pardente4702/esp32_rgb_led_matrix_clock/src/main.cpp
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <WiFi.h>
#include <RTClib.h>
// #include <SHT21.h>
#include "WifiCredentials.h"
//#include "SinricProCredentials.h"
#include <time.h>
#include <HTTPClient.h>
#include <List.hpp>
#include <Wire.h>
#include "Adafruit_HTU21DF.h"
#include <Adafruit_GFX.h>
#include <Fonts/FreeSans9pt7b.h>
#include <Fonts/FreeSansBold9pt7b.h>
#include <Fonts/Org_01.h>
#include <Fonts/TomThumb.h>
#include <SD.h>
#include <SPI.h>
#include <TinyXML2.h>
using namespace tinyxml2;

//#include "SinricPro.h"
//#include "SinricProSwitch.h"

boolean orologioAttivo = true; // Variabile per controllare se l'orologio è attivo

// Definizioni pin per modulo scheda microSD
#define SD_CS 33
#define MOSI 23
#define MISO 19
#define SCK 18

// Definizioni pin per matrice LED HUB75
#define R1_PIN 25
#define G1_PIN 26
#define B1_PIN 27
#define R2_PIN 14
#define G2_PIN 12
#define B2_PIN 13
#define A_PIN 2
#define B_PIN 32
#define C_PIN 17
#define D_PIN 5
#define E_PIN -1
#define LAT_PIN 4
#define OE_PIN 15
#define CLK_PIN 16

HUB75_I2S_CFG::i2s_pins _pins = {R1_PIN, G1_PIN, B1_PIN, R2_PIN, G2_PIN, B2_PIN, A_PIN, B_PIN, C_PIN, D_PIN, E_PIN, LAT_PIN, OE_PIN, CLK_PIN};

#define PANEL_RES_X 64 // Number of pixels wide of each INDIVIDUAL panel module.
#define PANEL_RES_Y 32 // Number of pixels tall of each INDIVIDUAL panel module.
#define PANEL_CHAIN 1  // Total number of panels chained one to another

// MatrixPanel_I2S_DMA dma_display;
MatrixPanel_I2S_DMA *dma_display = nullptr;

uint16_t myBLACK = dma_display->color565(0, 0, 0);
uint16_t myWHITE = dma_display->color565(255, 255, 255);
uint16_t myRED = dma_display->color565(255, 0, 0);
uint16_t myGREEN = dma_display->color565(0, 255, 0);
uint16_t myBLUE = dma_display->color565(0, 0, 255);
uint16_t myNEWS = dma_display->color565(255, 255, 0);
uint16_t myHOURS = dma_display->color565(255, 105, 180);
uint16_t myMINUTES = dma_display->color565(80, 200, 255);

char lastTimeStr[9] = "00:00:00";
char scrollingText[256] = {0};
int textX = PANEL_RES_X;
const char *newsSeparator = " - ";

RTC_DS3231 rtc;
// SHT21 sht;

// Crea un'istanza del sensore
Adafruit_HTU21DF htu = Adafruit_HTU21DF();

const int LDR_PIN = 34; // Pin analogico a cui è collegato il sensore LDR

char daysOfTheWeek[7][12] = {"Domenica", "Lunedi'", "Martedi'", "Mercoledi'", "Giovedi'", "Venerdi'", "Sabato"};
const char *months[] = {"Gen", "Feb", "Mar", "Apr", "Mag", "Giu", "Lug", "Ago", "Set", "Ott", "Nov", "Dic"};

uint32_t tempBrightnessUpdateInterval = 15000; // 15 secondi
uint32_t scrollingSpeed = 20;

// Imposta la luminosità minima e massima
const int brightnessMin = 30;  // minimo di notte
const int brightnessMax = 220; // massimo di giorno

uint32_t newsUpdateInterval = 1200000; // 20 minuti
uint32_t timeUpdateInterval = 3600000; // 1 ora

int brightness = brightnessMax;

// const char *rss_feed_url = "https://www.ansa.it/lazio/notizie/lazio_rss.xml";
const char *rss_feed_url = "https://www.repubblica.it/rss/homepage/rss2.0.xml?ref=RHFT";

uint8_t indiceNotizia = 0;

List<String> newsList;

unsigned long lastAttempt = 0;
const long interval = 5000; // Try to reconnect every 5 seconds

enum InfoRowState
{
  INFO_TEMP,
  INFO_DAY,
  INFO_DATE
};
InfoRowState infoRowState = INFO_TEMP;

const uint8_t TIME_AREA_TOP = 0;
const uint8_t TIME_AREA_HEIGHT = 16;
const uint8_t INFO_ROW_Y = 16;
const uint8_t NEWS_ROW_Y = 24;
const uint8_t TIME_LEFT_X = 2;

bool wifiConnected()
{
  return WiFi.status() == WL_CONNECTED;
}

void clearNewsRow()
{
  dma_display->fillRect(0, NEWS_ROW_Y, PANEL_RES_X, 8, 0);
}

bool onPowerState1(const String &deviceId, bool &state)
{
  Serial.printf("Stato orologio: %s\r\n", state ? "on" : "off");
  orologioAttivo = state;
  return true; // request handled properly
}

// setup function for SinricPro
/*
void setupSinricPro()
{
  SinricProSwitch &mySwitch1 = SinricPro[SWITCH_ID_1];
  mySwitch1.onPowerState(onPowerState1);

  // setup SinricPro
  SinricPro.onConnected([]()
                        { Serial.printf("Connected to SinricPro\r\n"); });
  SinricPro.onDisconnected([]()
                           { Serial.printf("Disconnected from SinricPro\r\n"); });
  SinricPro.restoreDeviceStates(true); // Uncomment to restore the last known state from the server.

  SinricPro.begin(APP_KEY, APP_SECRET);
}
*/

// Funzione per scaricare il feed RSS e salvarlo su SD
void scaricaFeed(String url, const char *path)
{
  HTTPClient http;
  http.begin(url);
  int httpCode = http.GET();

  if (httpCode != HTTP_CODE_OK)
  {
    Serial.printf("Errore HTTP: %d\n", httpCode);
    http.end();
    return;
  }

  File file = SD.open(path, FILE_WRITE);
  if (!file)
  {
    Serial.println("Errore apertura file SD!");
    http.end();
    return;
  }

  WiFiClient *stream = http.getStreamPtr();
  uint8_t buffer[512];
  size_t total = 0;

  Serial.println("Scaricamento in corso...");
  while (http.connected())
  {
    size_t len = stream->readBytes(buffer, sizeof(buffer));
    if (len > 0)
    {
      file.write(buffer, len);
      total += len;
    }
    else
      break;
  }

  file.close();
  http.end();
  Serial.printf("Feed salvato su SD (%u byte)\n", (unsigned int)total);
}

// Funzione per ripulire il feed RSS
void cleanupFeed(const char *inputPath, const char *outputPath)
{
  File inFile = SD.open(inputPath, FILE_READ);
  if (!inFile)
  {
    Serial.println("Errore: impossibile aprire il file sorgente.");
    return;
  }

  File tempFile = SD.open(outputPath, FILE_WRITE);
  if (!tempFile)
  {
    Serial.println("Errore: impossibile creare il file di output.");
    inFile.close();
    return;
  }

  bool foundRSS = false;
  bool finishedRSS = false;
  char window[6] = {0}; // buffer scorrevole per cercare pattern

  while (inFile.available())
  {
    char c = inFile.read();

    // Scorri il buffer di 1 posizione e aggiungi il nuovo carattere
    memmove(window, window + 1, 5);
    window[5] = c;

    // --- TROVA INIZIO <rss ---
    if (!foundRSS && strncmp(window + 2, "<rss", 4) == 0)
    {
      foundRSS = true;
      tempFile.print("<rss");
    }

