pardente4702/esp32_rgb_led_matrix_clock/src/main.cpp
    // --- SE ABBIAMO TROVATO <rss> E NON ABBIAMO FINITO ---
    else if (foundRSS && !finishedRSS)
    {
      tempFile.write(c);

      // Controlla se abbiamo appena scritto la chiusura </rss>
      if (strncmp(window + 1, "rss>", 4) == 0)
      {
        finishedRSS = true;
        break; // stop lettura, ignoriamo tutto dopo </rss>
      }
    }
  }

  inFile.close();
  tempFile.close();

  if (foundRSS && finishedRSS)
  {
    Serial.println("Feed ripulito: salvato solo da <rss> a </rss>.");
  }
  else if (!foundRSS)
  {
    Serial.println("Tag <rss> non trovato nel file.");
  }
  else if (!finishedRSS)
  {
    Serial.println("Tag di chiusura </rss> non trovato (file incompleto).");
  }

  if (SD.remove("/feed.xml"))
  {
    Serial.println("File feed.xml cancellato con successo!");
  }
  else
  {
    Serial.println("Errore: impossibile cancellare feed.xml (forse non esiste?)");
  }
}

// Funzione per rimuovere gli accenti dalle lettere
void rimuoviAccenti(char *cdataBuffer)
{
  for (int i = 0; cdataBuffer[i] != '\0'; ++i)
  {
    unsigned char c = (unsigned char)cdataBuffer[i];
    if (c == 0xC3)
    { // In UTF-8, accenti iniziano con 0xC3
      unsigned char next = (unsigned char)cdataBuffer[i + 1];
      switch (next)
      {
      case 0xA0:
        cdataBuffer[i] = 'a';
        cdataBuffer[i + 1] = '\'';
        break; // à
      case 0xA8:
        cdataBuffer[i] = 'e';
        cdataBuffer[i + 1] = '\'';
        break; // è
      case 0xA9:
        cdataBuffer[i] = 'e';
        cdataBuffer[i + 1] = '\'';
        break; // é
      case 0xAC:
        cdataBuffer[i] = 'i';
        cdataBuffer[i + 1] = '\'';
        break; // ì
      case 0xB2:
        cdataBuffer[i] = 'o';
        cdataBuffer[i + 1] = '\'';
        break; // ò
      case 0xB9:
        cdataBuffer[i] = 'u';
        cdataBuffer[i + 1] = '\'';
        break; // ù
      case 0x80:
        cdataBuffer[i] = 'A';
        cdataBuffer[i + 1] = '\'';
        break; // À
      case 0x88:
        cdataBuffer[i] = 'E';
        cdataBuffer[i + 1] = '\'';
        break; // È
      case 0x8C:
        cdataBuffer[i] = 'I';
        cdataBuffer[i + 1] = '\'';
        break; // Ì
      case 0x92:
        cdataBuffer[i] = 'O';
        cdataBuffer[i + 1] = '\'';
        break; // Ò
      case 0x99:
        cdataBuffer[i] = 'U';
        cdataBuffer[i + 1] = '\'';
        break; // Ù
      default:
        break;
      }
    }
    // Gestione virgolette tipografiche “ e ”
    else if (c == 0xE2)
    {
      unsigned char next1 = (unsigned char)cdataBuffer[i + 1];
      unsigned char next2 = (unsigned char)cdataBuffer[i + 2];

      // “ (E2 80 9C) oppure ” (E2 80 9D)
      if (next1 == 0x80 && (next2 == 0x9C || next2 == 0x9D))
      {
        cdataBuffer[i] = '"';
        // Rimuovi i due byte successivi spostando la stringa a sinistra
        memmove(&cdataBuffer[i + 1], &cdataBuffer[i + 3], strlen(&cdataBuffer[i + 3]) + 1);
      }
      // ’ (apostrofo tipografico, E2 80 99)
      else if (next1 == 0x80 && next2 == 0x99)
      {
        cdataBuffer[i] = '\'';
        memmove(&cdataBuffer[i + 1], &cdataBuffer[i + 3], strlen(&cdataBuffer[i + 3]) + 1);
      }
    }
  }
}

// Funzione per il parsing RSS con TinyXML2
boolean parseRSS(const char *path)
{
  File file = SD.open(path, FILE_READ);
  if (!file)
  {
    Serial.println("Errore apertura file RSS!");
    return false;
  }

  // Legge tutto il file in un buffer (necessario per TinyXML2)
  String xmlContent;
  while (file.available())
  {
    xmlContent += (char)file.read();
  }
  file.close();

  XMLDocument doc;
  XMLError e = doc.Parse(xmlContent.c_str());
  if (e != XML_SUCCESS)
  {
    Serial.print("Errore parsing XML: ");
    Serial.println(e);
    return false;
  }

  newsList.removeAll(); // Cancella la lista delle notizie
  indiceNotizia = 0;    // Resetta l'indice della notizia

  // Ottieni nodo radice <rss>
  XMLElement *rss = doc.FirstChildElement("rss");
  if (!rss)
  {
    Serial.println("Tag <rss> non trovato!");
    return false;
  }

  // Trova <channel>
  XMLElement *channel = rss->FirstChildElement("channel");
  if (!channel)
  {
    Serial.println("Tag <channel> non trovato!");
    return false;
  }

  // --- Leggi info generali ---
  const char *title = channel->FirstChildElement("title") ? channel->FirstChildElement("title")->GetText() : "";
  const char *link = channel->FirstChildElement("link") ? channel->FirstChildElement("link")->GetText() : "";
  const char *desc = channel->FirstChildElement("description") ? channel->FirstChildElement("description")->GetText() : "";

  /*
  Serial.println("=== RSS CHANNEL ===");
  Serial.printf("Titolo: %s\n", title);
  Serial.printf("Link:   %s\n", link);
  Serial.printf("Descr:  %s\n\n", desc);
  */

  // --- Leggi tutti gli <item> ---
  for (XMLElement *item = channel->FirstChildElement("item");
       item != nullptr;
       item = item->NextSiblingElement("item"))
  {

    const char *itemTitle = item->FirstChildElement("title") ? item->FirstChildElement("title")->GetText() : "";
    const char *itemLink = item->FirstChildElement("link") ? item->FirstChildElement("link")->GetText() : "";
    const char *itemDesc = item->FirstChildElement("description") ? item->FirstChildElement("description")->GetText() : "";

    // Serial.println("--- ITEM ---");
    Serial.printf("Titolo: %s\n", itemTitle);
    // Converte in String per sicurezza
    String titolo = String(itemTitle);

    // Crea un buffer temporaneo (lunghezza dinamica)
    char buffer[titolo.length() + 1];
    titolo.toCharArray(buffer, sizeof(buffer));

    // Rimuove accenti
    rimuoviAccenti(buffer);
    // Aggiunge la notizia alla lista (convertendo di nuovo in String)
    newsList.add(String(buffer));

    // Serial.printf("Link:   %s\n", itemLink);
    // Serial.printf("Descr:  %s\n\n", itemDesc);
  }
  return true;
}

String leftPad(int number, int totalLength)
{
  // Convertiamo il numero in stringa
  String str = String(number);

  // Calcoliamo quanto padding è necessario
  int paddingNeeded = totalLength - str.length();

