pardente4702/esp32_rgb_led_matrix_clock/src/main.cpp
  // Aggiungiamo zeri a sinistra
  for (int i = 0; i < paddingNeeded; i++)
  {
    str = "0" + str; // Aggiungiamo uno zero a sinistra
  }

  return str;
}

// Calcola i pixel a sinistra per centrare una stringa
int centraStringa(String str)
{
  unsigned int stringLength = str.length();
  int leftSpace = (int)((64 - (6 * stringLength)) / 2);
  return leftSpace;
}

void syncRTCwithNTP()
{
  struct tm timeinfo;

  if (getLocalTime(&timeinfo))
  {

    // Converte struct tm in oggetto DateTime
    DateTime dt(
        timeinfo.tm_year + 1900,
        timeinfo.tm_mon + 1,
        timeinfo.tm_mday,
        timeinfo.tm_hour,
        timeinfo.tm_min,
        timeinfo.tm_sec);

    // Scrive l'orario sull'RTC
    // rtc.begin();
    rtc.adjust(dt);

    Serial.print("RTC updated to: ");
    Serial.println(&timeinfo, "%A, %d %B %Y %H:%M:%S");
  }
}

void stampaOra()
{
  DateTime now = rtc.now();
  Serial.print("Ora: ");
  Serial.print((now.hour() < 10 ? "0" : "") + String(now.hour(), DEC));
  Serial.print(":");
  Serial.print((now.minute() < 10 ? "0" : "") + String(now.minute(), DEC));
  Serial.print(":");
  Serial.println((now.second() < 10 ? "0" : "") + String(now.second(), DEC));
}

String readTemperatureAndHumidity()
{
  static u_int8_t count = 0;

  float temperature = htu.readTemperature(); // Legge la temperatura
  float humidity = htu.readHumidity();       // Legge l'umidità

  // Controlla se ci sono errori nella lettura
  if (isnan(temperature) || isnan(humidity))
  {
    Serial.println("Errore nella lettura del sensore!");
    return "";
  }

  // Formatta i valori float in una stringa
  String bufferTemp;
  if (count == 0)
  {
    bufferTemp = "Tmp:" + (String)temperature + "C";
  }
  else
  {
    bufferTemp = "Umd:" + (String)humidity + "%";
  }

  count = (count + 1) % 2;

  return bufferTemp;
}

void visualizzaInfoRiga(DateTime now)
{
  dma_display->fillRect(0, INFO_ROW_Y, PANEL_RES_X, 8, 0);
  dma_display->setTextSize(1);
  dma_display->setTextWrap(false);

  if (infoRowState == INFO_TEMP)
  {
    dma_display->setCursor(2, INFO_ROW_Y);
    dma_display->setTextColor(dma_display->color565(255, 0, 0));
    dma_display->print(readTemperatureAndHumidity());
  }
  else if (infoRowState == INFO_DAY)
  {
    int leftSpace = centraStringa((String)daysOfTheWeek[now.dayOfTheWeek()]);
    dma_display->setCursor(leftSpace, INFO_ROW_Y);
    dma_display->setTextColor(dma_display->color565(60, 180, 60));
    dma_display->print(daysOfTheWeek[now.dayOfTheWeek()]);
  }
  else
  {
    int leftSpace = 3;
    dma_display->setCursor(leftSpace, INFO_ROW_Y);
    dma_display->setTextColor(dma_display->color565(60, 180, 60));
    dma_display->print(leftPad(now.day(), 2));
    dma_display->setCursor(leftSpace + 14, INFO_ROW_Y);
    dma_display->print(months[now.month() - 1]);
    dma_display->setCursor(leftSpace + 34, INFO_ROW_Y);
    dma_display->print(now.year());
  }
}

void visualizzaOraGrande(const String &hours, const String &minutes, const String &seconds)
{
  String hh = hours;
  String mm = minutes;
  String ss = seconds;

  int16_t x1, y1, x2, y2;
  uint16_t w1, h1, w2, h2;

  dma_display->setFont(&FreeSansBold9pt7b);
  dma_display->getTextBounds("88:88", 0, 0, &x1, &y1, &w1, &h1);

  dma_display->setFont(&Org_01);
  dma_display->getTextBounds(":88", 0, 0, &x2, &y2, &w2, &h2);

  int startX = TIME_LEFT_X;
  int ascent1 = -y1;
  int ascent2 = -y2;
  int descent1 = (int)h1 - ascent1;
  int descent2 = (int)h2 - ascent2;
  int totalHeight = max(ascent1, ascent2) + max(descent1, descent2);
  int baseline = TIME_AREA_TOP + (TIME_AREA_HEIGHT - totalHeight) / 2 + max(ascent1, ascent2);

  dma_display->fillRect(0, TIME_AREA_TOP, PANEL_RES_X, TIME_AREA_HEIGHT, 0);

  bool blinkOn = (seconds.toInt() % 2) == 0;
  uint16_t yellow = dma_display->color565(255, 255, 0);
  uint16_t lightBlue = dma_display->color565(180, 220, 255);

  int x = startX;

  dma_display->setFont(&FreeSansBold9pt7b);
  dma_display->setTextColor(myHOURS);
  dma_display->setCursor(x, baseline);
  dma_display->print(hh);
  int16_t bx, by;
  uint16_t bw, bh;
  dma_display->getTextBounds(hh, 0, 0, &bx, &by, &bw, &bh);
  x += bw;

  x += 2;
  dma_display->setTextColor(yellow);
  dma_display->setCursor(x, baseline);
  dma_display->print(":");
  dma_display->getTextBounds(":", 0, 0, &bx, &by, &bw, &bh);
  x += bw + 1;

  dma_display->setTextColor(myMINUTES);
  dma_display->setCursor(x, baseline);
  dma_display->print(mm);
  dma_display->getTextBounds(mm, 0, 0, &bx, &by, &bw, &bh);
  x += bw + 2;

  dma_display->setFont(&TomThumb);
  dma_display->setTextSize(1);
  x += 1;
  dma_display->setTextColor(blinkOn ? lightBlue : myBLACK);
  dma_display->setCursor(x, baseline);
  dma_display->print(":");
  dma_display->getTextBounds(":", 0, 0, &bx, &by, &bw, &bh);
  x += bw + 1;

  dma_display->setTextColor(lightBlue);
  dma_display->setCursor(x, baseline);
  dma_display->print(ss);

  dma_display->setFont(); // reset to default
  dma_display->setTextSize(1);
  dma_display->setTextWrap(false);
}

// Funzione per rimuovere duplicati da una lista di String
void rimuoveDuplicati(List<String> &list)
{
  for (int i = 0; i < list.getSize(); i++)
  {
    String current = list.get(i);

    // Controlla tutti gli elementi successivi
    for (int j = i + 1; j < list.getSize(); j++)
    {
      if (list.get(j) == current)
      {
        Serial.println("Rimuovo duplicato: " + current);
        list.remove(j);
        j--; // importantissimo: la lista si compatta
      }
    }
  }
}

// Funzione per scaricare, pulire e fare il parsing del feed RSS
void fetchRSSFeed()
{
  if (!wifiConnected())
  {
    Serial.println("WiFi non disponibile: salto aggiornamento news.");
    return;
  }

  Serial.println("Recupero feed RSS...");
  scaricaFeed(rss_feed_url, "/feed.xml");
  cleanupFeed("/feed.xml", "/feed_clean.xml");
  if (parseRSS("/feed_clean.xml"))
  {
    newsUpdateInterval = 1200000; // Ripristina l'intervallo normale in caso di successo
    rimuoveDuplicati(newsList);   // Rimuove duplicati
  }
  else
  {
    newsUpdateInterval = 120000; // Riduci l'intervallo in caso di errore
  }
}

bool waitForWiFiConnection(unsigned long timeoutMs)
{
  unsigned long start = millis();
  while (!wifiConnected() && (millis() - start < timeoutMs))
  {
    Serial.print(".");
    delay(500);
  }

