pardente4702/esp32_rgb_led_matrix_clock/src/main.cpp
  return wifiConnected();
}

void setup()
{
  Serial.begin(115200);
  esp_reset_reason_t reason = esp_reset_reason();
  Serial.print("Motivo Reset: ");
  switch (reason)
  {
  case ESP_RST_POWERON:
    Serial.println("Power-on reset");
    break;
  case ESP_RST_EXT:
    Serial.println("External reset");
    break;
  case ESP_RST_SW:
    Serial.println("Software reset");
    break;
  case ESP_RST_PANIC:
    Serial.println("Exception/panic reset");
    break;
  case ESP_RST_INT_WDT:
    Serial.println("Interrupt watchdog reset");
    break;
  case ESP_RST_TASK_WDT:
    Serial.println("Task watchdog reset");
    break;
  case ESP_RST_WDT:
    Serial.println("Other watchdog reset");
    break;
  case ESP_RST_DEEPSLEEP:
    Serial.println("Wake from deep sleep");
    break;
  default:
    Serial.println("Unknown reason");
    break;
  }

  SPI.begin(18, 19, 23, SD_CS); // SCK = 18, MISO = 19, MOSI = 23
  // Configura i pin fisici

  if (!SD.begin(SD_CS))
  {
    Serial.println("Errore inizializzazione scheda SD");
    return;
  }
  Serial.println("Scheda SD inizializzata.");

  // Connessione al WiFi
  Serial.println("In attesa di connettersi al WiFi");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  if (waitForWiFiConnection(10000))
  {
    Serial.println("\nConnesso al WiFi");
    Serial.print("Indirizzo IP: ");
    Serial.println(WiFi.localIP());

    delay(1000);      // Attendi 1 secondo per stabilizzare la connessione
    //setupSinricPro(); // Inizializza SinricPro dopo la connessione WiFi
  }
  else
  {
    Serial.println("\nNon connesso al WiFi");
  }

  // Inizializza I2C (puoi cambiare i pin se necessario)
  Wire.begin(21, 22); // SDA = 21, SCL = 22

  // Inizializza il sensore
  if (!htu.begin())
  {
    Serial.println("Errore: HTU21D non trovato!");
    while (1)
      ;
  }

  Serial.println("HTU21D inizializzato correttamente");

  // Imposta il fuso orario italiano con ora legale
  configTzTime("CET-1CEST,M3.5.0/2,M10.5.0/3", "pool.ntp.org");

  // Avvia il client NTP
  // timeClient.begin();

  pinMode(LDR_PIN, INPUT); // Imposta il pin LDR come ingresso

  // initializing the rtc
  if (!rtc.begin())
  {
    Serial.println("Couldn't find RTC!");
    Serial.flush();
    // while (1) delay(10);
    delay(3000);
    ESP.restart(); // Riavvia il dispositivo
  }

  if (rtc.lostPower())
  {
    // this will adjust to the date and time at compilation
    // rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));
    Serial.println("RTC lost power, setting default time...");
  }

  // we don't need the 32K Pin, so disable it
  rtc.disable32K();

  // Imposta il modulo DS3231 per generare un segnale SQW di 1Hz (necessario per rilevare l'inizio di ogni ora)
  rtc.writeSqwPinMode(DS3231_SquareWave1Hz);
  Serial.println("Modulo RTC DS3231 configurato.");

  syncRTCwithNTP(); // Sincronizza all'avvio

  // Module configuration
  HUB75_I2S_CFG mxconfig(
      PANEL_RES_X, // module width
      PANEL_RES_Y, // module height
      PANEL_CHAIN, // Chain length
      _pins);

  //  ::SHIFTREG; // Tipico per pannelli HUB75
  mxconfig.driver = HUB75_I2S_CFG::FM6126A;

  // Display Setup
  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  // dma_display->begin();

  // Allocate memory and start DMA display
  if (not dma_display->begin())
    Serial.println("****** !KABOOM! HUB75 memory allocation failed ***********");
  dma_display->setBrightness8(brightness); // 0-255
  dma_display->clearScreen();
  dma_display->fillScreen(myBLACK);

  if (wifiConnected())
  {
    fetchRSSFeed();
  }
  else
  {
    clearNewsRow();
  }

  visualizzaInfoRiga(rtc.now());
}

void gestisciOrologio()
{

  DateTime now = rtc.now();
  String hours = (now.hour() < 10 ? "0" : "") + String(now.hour(), DEC);
  String minutes = (now.minute() < 10 ? "0" : "") + String(now.minute(), DEC);
  String seconds = (now.second() < 10 ? "0" : "") + String(now.second(), DEC);

  char timeStr[9];
  sprintf(timeStr, "%s:%s:%s", hours, minutes, seconds);

  if (strcmp(timeStr, lastTimeStr) != 0)
  {                                                  // Aggiorna solo se cambia
    visualizzaOraGrande(hours, minutes, seconds);
    strcpy(lastTimeStr, timeStr);
  }

  // Reload news list
  static unsigned long lastUpdateNewsTime = 0;
  if (millis() > lastUpdateNewsTime + newsUpdateInterval)
  {
    Serial.println("Reload news...");
    lastUpdateNewsTime = millis();
    indiceNotizia = 0;
    textX = PANEL_RES_X;
    // fetchRSSFeed();
  }

  static unsigned long lastUpdateDisplay = 0;
  if (!wifiConnected() || (newsList.getSize() == 0))
  {
    clearNewsRow();
  }
  else if (millis() > lastUpdateDisplay + scrollingSpeed)
  {
    lastUpdateDisplay = millis();
    String notizia = newsList.get(indiceNotizia);
    String notiziaSuccessiva = newsList.get((indiceNotizia + 1) % newsList.getSize());
    String testoScorrevole = notizia + newsSeparator + notiziaSuccessiva;
    if (testoScorrevole.length() >= (int)sizeof(scrollingText))
    {
      testoScorrevole.remove(sizeof(scrollingText) - 1);
    }
    testoScorrevole.toCharArray(scrollingText, sizeof(scrollingText));
    clearNewsRow();
    dma_display->setFont();
    dma_display->setTextSize(1);
    dma_display->setCursor(textX, NEWS_ROW_Y);
    dma_display->setTextColor(myNEWS);
    dma_display->print(scrollingText);
    // dma_display->show();

    textX--;
    int lunghezzaBloccoCorrente = (notizia.length() + strlen(newsSeparator)) * 6;
    int limiteNegativo = 0 - lunghezzaBloccoCorrente;
    if (textX < limiteNegativo)
    {
      // Serial.print("Visualizzo la notizia numero ");
      // Serial.println(indiceNotizia);
      textX += lunghezzaBloccoCorrente;
      indiceNotizia = (indiceNotizia + 1) % newsList.getSize();
    }
  }

  // Aggiorna la luminosità e la temperatura ogni 30 secondi
  static unsigned long lastUpdateTime = 0;
  if (millis() > lastUpdateTime + tempBrightnessUpdateInterval)
  {
    lastUpdateTime = millis();

    int ldrValue = analogRead(LDR_PIN); // Legge il valore analogico dal sensore LDR
    // Serial.print("LDR value: ");
    // Serial.println(ldrValue); // Stampa il valore letto nel monitor seriale

    // Adatta questi range in base al tuo ambiente reale
    brightness = map(ldrValue, 4000, 100, brightnessMin, brightnessMax);
    brightness = constrain(brightness, brightnessMin, brightnessMax);
    dma_display->setBrightness8(brightness); // 0-255

    // syncRTCwithNTP();
  }

