pardente4702/esp32_rgb_led_matrix_clock/src/main.cpp
  // Alterno contenuti della riga info
  static unsigned long lastUpdateInfoRow = 0;
  if (millis() > lastUpdateInfoRow + 5000)
  {
    visualizzaInfoRiga(now);
    lastUpdateInfoRow = millis();
    if (infoRowState == INFO_TEMP)
      infoRowState = INFO_DAY;
    else if (infoRowState == INFO_DAY)
      infoRowState = INFO_DATE;
    else
      infoRowState = INFO_TEMP;
  }
}

void loop()
{
  delay(1); // Piccola pausa per evitare blocchi
  static boolean nextState = true;
  static unsigned long lastUpdateNews = 0;

  if (!wifiConnected())
  {
    if (millis() - lastAttempt >= interval)
    {
      Serial.println("WiFi disconnesso. In attesa di riconnessione...");
      clearNewsRow();
      newsList.removeAll();
      indiceNotizia = 0;
      textX = PANEL_RES_X;
      WiFi.disconnect();
      WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
      lastAttempt = millis();
    }
  }
  else
  {
    //SinricPro.handle();

    // Aggiorna l'ora dal NTP ogni ora
    static unsigned long lastUpdateTime = 0;
    if (millis() > lastUpdateTime + timeUpdateInterval)
    {
      syncRTCwithNTP(); // Sincronizza ogni mez'ora
      Serial.println("Sincronizzazione RTC con NTP eseguita con successo.");
      lastUpdateTime = millis();
    }
    if (millis() > lastUpdateNews + newsUpdateInterval)
    {
      fetchRSSFeed();
      lastUpdateNews = millis();
    }
  }

  if (orologioAttivo)
  {
    gestisciOrologio();
    nextState = false;
  }
  else
  {
    // Se l'orologio non è attivo, non fare nulla
    if (nextState == false)
    {
      dma_display->fillScreen(myBLACK); // Pulisce lo schermo
      nextState = true;
    }
  }
}
